In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
semana = input("Ingrese Semana: ")

Ingrese Semana: 40

# Carga de Datos

In [3]:
mainpath = "C:/Users/mromo/Desktop/Rappi/Datasets/S"+semana+"/Data"
ganancias_path = "Detalle Ganancia S"+semana+".csv"
deuda_path = "Detalle Deuda S"+semana+".csv"
garantias_path = "Garantias Semanales.xlsx"
conexion_path = "Info Conexion.csv"
incentivos_path = "Incentivos Sem "+semana+".xlsx"

fp_earn = os.path.join(mainpath,ganancias_path)
fp_debt = os.path.join(mainpath,deuda_path)
fp_garantias = os.path.join(mainpath,garantias_path)
fp_incentivos = os.path.join(mainpath,incentivos_path)
fp_conexion = os.path.join(mainpath,conexion_path)

# Data Frames

In [4]:
df_earn = pd.read_csv(fp_earn, parse_dates = ['created_at'])
df_debt = pd.read_csv(fp_debt, parse_dates = ['created_at'])
df_conexion = pd.read_csv(fp_conexion, parse_dates = ['fecha'])

In [5]:
ids_vina = [10440, 12061, 12062, 12064, 12065, 12066, 12068, 12081,12082,12083,12084,12085,12086,12088,12391,12096,
12098,12097,12099,12138,12140,12141,12142,12208,12145,12212,12209,12211,12244,12241,12242,12250,
12249,12243,12247,12248,12246,12245,12253,12254,12302,12319,12326,12325,12310,12460]
df_vina = df_conexion[df_conexion['skid'].isin(ids_vina)]

df_bonus25 = df_bonus25.fillna(0)
df_bonus60 = df_bonus60.fillna(0)
df_conexion = df_conexion.fillna(0)

In [6]:
df_earn = df_earn[df_earn['storekeeper_id']!=48]
df_earn = df_earn[df_earn['storekeeper_id']!=12060]

In [7]:
df_earn.head(10)

,storekeeper_id,created_at,name,model_id,total,description
0,10042,2018-10-01 19:10:23.880,service_cost,241626,1400.0,NaN
1,10042,2018-10-01 20:30:47.866,service_cost,241917,1400.0,NaN
2,10042,2018-10-01 20:30:47.892,surcharge_paid_for_rappi,241917,25.0,NaN
3,10042,2018-10-06 12:54:17.416,service_cost,265236,1400.0,NaN
4,10042,2018-10-06 12:54:17.448,surcharge_paid_for_rappi,265236,100.0,NaN
5,10042,2018-10-06 13:25:30.721,service_cost,265362,1400.0,NaN
6,10042,2018-10-06 13:57:42.251,service_cost,265714,1400.0,NaN
7,10042,2018-10-06 14:42:13.668,service_cost,266092,1400.0,NaN
8,10042,2018-10-06 14:42:13.691,surcharge_paid_for_rappi,266092,75.0,NaN
9,10042,2018-10-06 15:21:44.181,service_cost,266534,1400.0,NaN

In [8]:
df_conexion.head(10)

   skid      fecha  hora      time  orders  ganancia tenia_cupo
0     1 2018-10-01     0  1.283333     NaN       NaN         No
1     1 2018-10-01     1  1.350000     NaN       NaN         No
2     1 2018-10-01     2  1.650000     NaN       NaN         No
3     1 2018-10-01     3  1.400000     NaN       NaN         No
4     1 2018-10-01     4  1.383333     NaN       NaN         No
5     1 2018-10-01     5  1.516667     NaN       NaN         No
6     1 2018-10-01     6  1.450000     NaN       NaN         No
7     1 2018-10-01     7  1.700000     NaN       NaN         No
8     1 2018-10-01     8  1.600000     NaN       NaN         No
9     1 2018-10-01     9  2.033333     NaN       NaN         No

df_bonus25 = df_bonus25.set_index('Inicio')
df_bonus60 = df_bonus60.set_index('Inicio')

# Garantias Dias

# Totales

In [9]:
df_debt[df_debt['name'].str.startswith("order")]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
2002,324510,10803,2018-10-03 16:38:18.486,order_not_delivered_manual_debt,5279,-15900.0
2042,324834,11666,2018-10-03 17:46:31.045,order_not_delivered_manual_debt,5282,-44520.0
2052,324892,12255,2018-10-03 17:59:31.744,order_not_delivered_manual_debt,5283,-3725.0
2111,325408,11782,2018-10-03 19:12:43.326,order_not_delivered_manual_debt,5285,-68400.0
2114,325429,11782,2018-10-03 19:14:00.238,order_not_delivered_manual_debt,5286,-23760.0
2116,325443,11063,2018-10-03 19:15:11.793,order_not_delivered_manual_debt,5287,-68400.0
2464,328490,10702,2018-10-04 00:01:48.878,order_not_delivered_manual_debt,5288,-47400.0
2502,328791,12000,2018-10-04 10:11:58.835,order_not_delivered_manual_debt,5290,-10490.0
3674,333221,10944,2018-10-04 18:04:45.112,order_not_delivered_manual_debt,5303,-38758.0
3698,333456,11262,2018-10-04 18:40:01.169,order_not_delivered_manual_debt,5304,-15880.0
4039,338970,11262,2018-10-05 14:35:02.313,order_not_delivered_manual_debt,5350,-13980.0
4331,341500,10640,2018-10-05 18:36:42.113,order_not_delivered_manual_debt,5361,-3600.0

In [10]:
df_calcGarantias = df_conexion
df_resumen = df_conexion
df_resumen = df_resumen.drop(labels = ['hora'], axis =1)

In [11]:
dias_trabajados = df_resumen.groupby(['skid','fecha'])

In [12]:
#Totales Minutos, Ganancias, etc
df_resumen = df_resumen.groupby('skid').sum()

In [13]:
df_calcGarantias.head(10)

   skid      fecha  hora      time  orders  ganancia tenia_cupo
0     1 2018-10-01     0  1.283333     NaN       NaN         No
1     1 2018-10-01     1  1.350000     NaN       NaN         No
2     1 2018-10-01     2  1.650000     NaN       NaN         No
3     1 2018-10-01     3  1.400000     NaN       NaN         No
4     1 2018-10-01     4  1.383333     NaN       NaN         No
5     1 2018-10-01     5  1.516667     NaN       NaN         No
6     1 2018-10-01     6  1.450000     NaN       NaN         No
7     1 2018-10-01     7  1.700000     NaN       NaN         No
8     1 2018-10-01     8  1.600000     NaN       NaN         No
9     1 2018-10-01     9  2.033333     NaN       NaN         No

In [14]:
df_calcGarantias.insert(6,"Total Pedidos",0)

In [15]:
df_calcGarantias.insert(7,"garantia horas",0)

In [16]:
df_calcGarantias.insert(8,"garantia especial",0)

In [17]:
#df con horas para garantia
df_calcGarantias = df_calcGarantias.fillna(0)

In [18]:
dias_trabajados = dias_trabajados.sum().reset_index()

In [19]:
#Suma total Dias Trabajados por RT
dtrab = dias_trabajados.groupby('skid').fecha.count()
dtrab.head(10)

skid
1        8
10042    3
10045    1
10047    7
10048    8
10050    2
10057    4
10059    8
10061    5
10065    4
Name: fecha, dtype: int64

In [20]:
df_debt = df_debt.sort_values('storekeeper_id',ascending = True)
df_debt['total'] = df_debt['total'].astype(int)

In [21]:
df_debt[df_debt['storekeeper_id']== 10042]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
258,315544,10042,2018-10-01 19:10:23.863,cash_base,241626,-4000
4758,348832,10042,2018-10-06 17:38:34.697,cash_base,267737,-347
2526,329027,10042,2018-10-04 11:46:08.989,debt_by_balance,14,-1175

In [22]:
df_earn = df_earn.sort_values('storekeeper_id',ascending = True)
df_earn['total'] = df_earn['total'].astype(int)

In [23]:
df_earn.columns

Index(['storekeeper_id', 'created_at', 'name', 'model_id', 'total',
       'description'],
      dtype='object')

In [24]:
#df_incentivos = pd.DataFrame(df_earn.groupby('description').total.sum())

In [25]:
#df_incentivos

Probar Despues:
for i in df_calcGarantias.index:
    df_calcGarantias['garantia horas'][i] = getMonto(25,df_calcGarantias['hora'][i],3)

In [26]:
earn_res = df_earn.groupby('storekeeper_id')

In [27]:
earn_res = earn_res.total.sum()

In [28]:
df_ganancia = pd.DataFrame(earn_res)

In [29]:
df_ganancia.head(10)

                 total
storekeeper_id
10042            17800
10047            81550
10048           146025
10057            36175
10059           202350
10065           134380
10066           124950
10067            88410
10070            17600
10082           134350

In [30]:
df_debt[df_debt['storekeeper_id']==10042]

,dispersion_id,storekeeper_id,created_at,name,model_id,total
258,315544,10042,2018-10-01 19:10:23.863,cash_base,241626,-4000
4758,348832,10042,2018-10-06 17:38:34.697,cash_base,267737,-347
2526,329027,10042,2018-10-04 11:46:08.989,debt_by_balance,14,-1175

In [31]:
debt_res = df_debt.groupby(['storekeeper_id','name'])

In [32]:
debt_res = pd.DataFrame(debt_res.total.sum())

In [33]:
debt_res.head(10)

                                 total
storekeeper_id name
10042          cash_base         -4347
               debt_by_balance   -1175
10043          debt_by_balance  -56000
10045          debt_by_balance   -4230
10046          debt_by_balance  -25000
10047          cash_base        -11763
               debt_by_balance -167799
               pay_debt          75025
10048          cash_base       -111531
               debt_by_balance  -94862

In [34]:
#Resumen total deuda
df_deuda = pd.DataFrame(debt_res)
df_deuda = df_deuda.groupby('storekeeper_id').total.sum()

In [35]:
df_deuda2 = pd.DataFrame(df_deuda)

In [36]:
df_deuda2.head(10)

                 total
storekeeper_id
10042            -5522
10043           -56000
10045            -4230
10046           -25000
10047          -104537
10048           -16669
10049          -703530
10050            -2490
10054           -29102
10057          -184101

In [37]:
df_earn[df_earn['storekeeper_id']==10059].sum()

storekeeper_id                                              1438437
name              service_costtipservice_costservice_costtipserv...
model_id                                                   35439344
total                                                        202350
dtype: object

In [38]:
#Total Ganado Semana
df_ganancia['total'].values.ravel().sum()

47989817

In [39]:
#Total Cobros Semana
df_debt['total'].values.ravel().sum()

-97924314

In [40]:
df_final = pd.merge(df_ganancia,df_deuda2,how='outer',on = 'storekeeper_id')
df_final = df_final.fillna(0).sort_values('storekeeper_id')
df_final.insert(2,'Total a Pagar', df_final.total_x + df_final.total_y)

In [41]:
df_garantias = df_earn[df_earn['name']=='service_cost']

In [42]:
#Total Cobros Semana
df_debt['total'].values.ravel().sum()

-97924314

In [43]:
#Dataframe con Total de Ordenes por RT
df_ppay = df_garantias.groupby('storekeeper_id').total.count()
df_ppay2 = pd.DataFrame(df_ppay)
df_ppay2 = df_ppay2.reset_index()

In [44]:
df_debt[df_debt['name']=='order_not_delivered_manual_debt'].sort_values('storekeeper_id')

,dispersion_id,storekeeper_id,created_at,name,model_id,total
4331,341500,10640,2018-10-05 18:36:42.113,order_not_delivered_manual_debt,5361,-3600
2464,328490,10702,2018-10-04 00:01:48.878,order_not_delivered_manual_debt,5288,-47400
2002,324510,10803,2018-10-03 16:38:18.486,order_not_delivered_manual_debt,5279,-15900
3674,333221,10944,2018-10-04 18:04:45.112,order_not_delivered_manual_debt,5303,-38758
2116,325443,11063,2018-10-03 19:15:11.793,order_not_delivered_manual_debt,5287,-68400
3698,333456,11262,2018-10-04 18:40:01.169,order_not_delivered_manual_debt,5304,-15880
4039,338970,11262,2018-10-05 14:35:02.313,order_not_delivered_manual_debt,5350,-13980
2042,324834,11666,2018-10-03 17:46:31.045,order_not_delivered_manual_debt,5282,-44520
2114,325429,11782,2018-10-03 19:14:00.238,order_not_delivered_manual_debt,5286,-23760
2111,325408,11782,2018-10-03 19:12:43.326,order_not_delivered_manual_debt,5285,-68400
2502,328791,12000,2018-10-04 10:11:58.835,order_not_delivered_manual_debt,5290,-10490
2052,324892,12255,2018-10-03 17:59:31.744,order_not_delivered_manual_debt,5283,-3725

In [45]:
df_final = df_final.rename(columns= {'total_x':'Total Produccion S/Garantias','total_y':'Total Deuda'})

In [46]:
df_final = df_final.reset_index()
df_final[df_final['storekeeper_id']==10736]

     storekeeper_id  Total Produccion S/Garantias  Total Deuda  Total a Pagar
303           10736                        1400.0          0.0         1400.0

In [48]:
writer = pd.ExcelWriter('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Resumen S'+semana+'.xlsx')
df_earn.to_excel(writer,'Resumen Ganancia')
df_debt.to_excel(writer,'Resumen Deuda')
df_final.to_excel(writer,'Prod-Deuda')
df_calcGarantias.to_excel(writer, 'Calculo Garantias')
df_ppay2.to_excel(writer, 'Ordenes Totales')
df_resumen.to_excel(writer, 'Totales')
writer.save()
writer.close()

Agregar Glosa + Fecha para info que aparecera en la notificacion de la aplicacion.

In [49]:
dtrab.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Dias Trabajados.xlsx')
df_final.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Pagos S'+semana+'.xlsx')

In [50]:
#df_incentivos.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Detalle Incentivos.xlsx')

In [51]:
df_vina.to_excel('C:/Users/mromo/Desktop/Rappi/Datasets/S'+semana+'/Info Conexion '+semana+' - Via.xlsx')

In [53]:
pagos_vina = df_earn[df_earn['storekeeper_id'].isin(ids_vina)]

In [54]:
pagos_vina.groupby('storekeeper_id').total.sum().reset_index()

    storekeeper_id  total
0            10440   2000
1            12066   8025
2            12083  11200
3            12084   2900
4            12098   7000
5            12099   2500
6            12140   2500
7            12141   3000
8            12212   3000
9            12243   8000
10           12246  32575
11           12247   6500
12           12254   6000
13           12326  11500
14           12391   2500